#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.iam-role-for-lambda.aws_iam_role.this: Refreshing state... [id=LambdaRole]
module.s3-website.aws_s3_bucket.static_site: Refreshing state... [id=dubovsky-andrey-website-bucket]
module.s3-website.aws_s3_bucket_policy.static_site_policy: Refreshing state... [id=dubovsky-andrey-website-bucket]
module.s3-website.aws_s3_bucket_public_access_block.static_site_public_access_block: Refreshing state... [id=dubovsky-andrey-website-bucket]
module.s3-website.aws_s3_bucket_website_configuration.static_site_website: Refreshing state... [id=dubovsky-andrey-website-bucket]
module.iam-role-for-lambda.aws_iam_role_policy.cloudwatchlogs[0]: Refreshing state... [id=LambdaRole:cloudwatchlogs]
module.iam-role-for-lambda.aws_iam_role_policy.sns_and_ses[0]: Refreshing state... [id=LambdaRole:sns_and_ses]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.s3-website.aws_s3_bucket.static_site has been deleted
  - resource "aws_s3_bucket" "static_site" {
      - arn                         = "arn:aws:s3:::dubovsky-andrey-website-bucket" -> null
      - bucket                      = "dubovsky-andrey-website-bucket" -> null
      - bucket_regional_domain_name = "dubovsky-andrey-website-bucket.s3.us-east-1.amazonaws.com" -> null
      - id                          = "dubovsky-andrey-website-bucket" -> null
        tags                        = {
            "Environment" = "Production"
            "Name"        = "Static Site Bucket"
        }
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.s3-website.aws_s3_bucket.static_site will be created
  + resource "aws_s3_bucket" "static_site" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "dubovsky-andrey-website-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Production"
          + "Name"        = "Static Site Bucket"
        }
      + tags_all                    = {
          + "Environment" = "Production"
          + "Name"        = "Static Site Bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.s3-website.aws_s3_bucket_policy.static_site_policy will be created
  + resource "aws_s3_bucket_policy" "static_site_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.s3-website.aws_s3_bucket_public_access_block.static_site_public_access_block will be created
  + resource "aws_s3_bucket_public_access_block" "static_site_public_access_block" {
      + block_public_acls       = true
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = false
    }

  # module.s3-website.aws_s3_bucket_website_configuration.static_site_website will be created
  + resource "aws_s3_bucket_website_configuration" "static_site_website" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "error.html"
        }

      + index_document {
          + suffix = "index.html"
        }

      + routing_rule (known after apply)
    }

  # module.s3-website.aws_s3_object.website_files["error.html"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "dubovsky-andrey-website-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "error.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./modules/s3-website/website/error.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.s3-website.aws_s3_object.website_files["index.html"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "dubovsky-andrey-website-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./modules/s3-website/website/index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.s3-website.aws_s3_object.website_files["main.css"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "dubovsky-andrey-website-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/css"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "main.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./modules/s3-website/website/main.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.s3-website.aws_s3_object.website_files["serverless.js"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "dubovsky-andrey-website-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "serverless.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./modules/s3-website/website/serverless.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.s3-website.aws_s3_object.website_files["whiskers.png"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "dubovsky-andrey-website-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "whiskers.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./modules/s3-website/website/whiskers.png"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ website_url = "dubovsky-andrey-website-bucket.s3.us-east-1.amazonaws.com" -> (known after apply)

Warning: Value for undeclared variable

The root module does not declare a variable named "environment" but a value
was found in file "terraform.tfvars". If you meant to use this value, add a
"variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Value for undeclared variable

The root module does not declare a variable named "project" but a value was
found in file "terraform.tfvars". If you meant to use this value, add a
"variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Dubovsky-Andrey, Action: `pull_request`*